SELECT
     订单明细.产品ID as 订单明细_产品ID,
     订单.货主城市 AS 订单_货主城市,
     sum(订单明细.单价*订单明细.数量*(1-订单明细.折扣)) as 营业额,
     sum(订单明细.进价*订单明细.数量) as 成本
FROM
     订单 订单 INNER JOIN 订单明细 订单明细 ON 订单.订单ID = 订单明细.订单ID
WHERE 订单.货主城市='北京' or 订单.货主城市='成都' or 订单.货主城市='大连' or 订单.货主城市='昆明' or 订单.货主城市='南京' or 订单.货主城市='南昌' or 订单.货主城市='上海' or 订单.货主城市='深圳'
and year(订购日期) in (1996,1997)
group by 订单.货主城市,订单明细.产品ID

SELECT
     产品.产品名称 AS 产品_产品名称,
     产品.产品ID AS 产品_产品ID,
     类别.类别名称 AS 类别_类别名称
FROM
     产品 产品 INNER JOIN 类别 类别 ON 产品.类别ID = 类别.类别ID
     where 类别.类别ID<=3

